micropython/micropython/ports/esp32/boards/ESP32_GENERIC_P4/mpconfigboard.h
// Both of these can be set by mpconfigboard.cmake if a BOARD_VARIANT is
// specified.

#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME "Generic ESP32P4 module"
#endif

#ifndef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME "ESP32-P4"
#endif

#define MICROPY_PY_ESPNOW                (0)

#define MICROPY_PY_MACHINE_SDCARD           (1)
#define MICROPY_HW_SDMMC_LDO_CHAN_ID        (4)
// This board wires the SD/MMC card to SDMMC slot 0 with a full 4-bit bus.
#define MICROPY_HW_SDMMC_DEFAULT_SLOT       (0)
#define MICROPY_HW_SDMMC_DEFAULT_WIDTH      (4)

#ifndef USB_SERIAL_JTAG_PACKET_SZ_BYTES
#define USB_SERIAL_JTAG_PACKET_SZ_BYTES (64)
#endif

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL     (1)

#define MICROPY_PY_MACHINE_I2S          (1)

// Disable Wi-Fi and Bluetooth by default, these are re-enabled in the WIFI variants
#ifndef MICROPY_PY_NETWORK_WLAN
#define MICROPY_PY_NETWORK_WLAN         (0)
#endif
#ifndef MICROPY_PY_BLUETOOTH
#define MICROPY_PY_BLUETOOTH            (0)
#endif
